//Кузняк Данило МФ-11.
/*Завдання 1. Дано монотонну, безперервну функцію f(x), яка містить корінь на
відрізку [a,b], де b>a . Визначити корінь із заданою точністю якщо відомо, що
f(a)*f(b)<0
Метод половинного поділу чи дихотомії (дихотомія – зіставленість чи
протиставлення двох частин цілого) при знаходженні кореня рівняння f(x) = 0
полягає у діленні навпіл відрізка [a; b], де знаходиться корінь.
Словесний алгоритм:
➢ Знайти відрізок [ a, b]: f(a)*f(b)<0.
➢ Обчислити s (середнє) = (a+b)/2.
➢ Якщо f(a)*f(s)<0, то b = s, в іншому випадку a = s.
➢ Якщо |a – b| > E, то виконати пункт 2, інакше корінь з потрібною точністю
знайдено, і він дорівнює: x = (a+b)/2*/

#include "functions.h"

int main() {
    float result;
    float a, b;
    printf("Введіть початкові значення для проміжку [a, b]: ");
    scanf("%f %f", &a, &b);
    if (b > a) {
        result = squareMethod(a, b);
        printf("Наближене обчислення корення = %f", result);
    } else {
        printf("Значення b повинно бути більше за значення a.\n");
    }
    return 0;
}